---
kind: property
id: P:Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.AreaOfCurveLoop
source: html/013c123f-063b-751e-c888-389aea33948f.htm
---
# Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.AreaOfCurveLoop Property

The area of the CurveLoop of the roof or floor slab.

## Syntax (C#)
```csharp
public double AreaOfCurveLoop { get; }
```